# Preparing Mexico Data

In [1]:
import pandas as pd

In [60]:
# Load CSV files into DataFrames
df1 = pd.read_csv("../data/mexico-real-estate-1.csv")
df2 = pd.read_csv("../data/mexico-real-estate-2.csv")
df3 = pd.read_csv("../data/mexico-real-estate-3.csv")

# Print object type and shape for DataFrames
print("df1 type:", type(df1))
print("df1 shape:", df1.shape)
print()
print("df2 type:", type(df2))
print("df2 shape:", df2.shape)
print()
print("df3 type:", type(df3))
print("df3 shape:", df3.shape)

df1 type: <class 'pandas.core.frame.DataFrame'>
df1 shape: (700, 6)

df2 type: <class 'pandas.core.frame.DataFrame'>
df2 shape: (700, 6)

df3 type: <class 'pandas.core.frame.DataFrame'>
df3 shape: (700, 5)

### Clean df1
#### Inspect a DataFrame using the shape, info, and head in pandas.

In [16]:
# Print df1 shape
df1.shape

# Print df1 info
df1.info()

# Get output of df1 head
df1.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_usd      700 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 32.9+ KB

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de M�xico,19.560181,-99.233528,150,"$67,965.56"
1,house,Nuevo Le�n,25.688436,-100.198807,186,"$63,223.78"
2,apartment,Guerrero,16.767704,-99.764383,82,"$84,298.37"
3,apartment,Guerrero,16.829782,-99.911012,150,"$94,308.80"
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,"$94,835.67"

### Clean df1 by dropping rows with NaN values. Then remove the "$" and "," characters from "price_usd" and recast the values in the column as floats

#### DROP MISSING VALUES

In [18]:
# Drop missing values
df1.dropna(inplace=True)

In [66]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_usd      700 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 32.9+ KB

#### WORK with price_usd column

In [67]:
df1["price_usd"] = (
    df1["price_usd"]
    .str.replace("$", "")
    .str.replace(",", "")
    .astype(float)
)

# Clean df2

In [68]:
df2.info()
df2.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_mxn      700 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 32.9+ KB

  property_type       state        lat         lon  area_m2  price_mxn
0     apartment  Nuevo Le�n  25.721081 -100.345581       72    1300000
1     apartment      Puebla        NaN         NaN      190    2500000
2         house     Morelos  23.634501 -102.552788      360    5300000
3         house     Morelos        NaN         NaN       76     820000
4         house      Puebla        NaN         NaN      200    1100000

#### DROP the missing filed

In [38]:
df2.dropna(inplace=True)

In [69]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_mxn      700 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 32.9+ KB

#### Price field is mexican currency, so we have to convert this to USD, so convert to usd and assign and new column then remove the mexican price

In [70]:
df2["price_usd"] = (df2["price_mxn"] / 19).round(2)
df2 = df2.drop(columns=["price_mxn"])
df2.head()

  property_type       state        lat         lon  area_m2  price_usd
0     apartment  Nuevo Le�n  25.721081 -100.345581       72   68421.05
1     apartment      Puebla        NaN         NaN      190  131578.95
2         house     Morelos  23.634501 -102.552788      360  278947.37
3         house     Morelos        NaN         NaN       76   43157.89
4         house      Puebla        NaN         NaN      200   57894.74

# Clean df3

In [71]:
df3.info()
df3.head()

<class 'pandas.core.frame.DataFrame'>
Index: 582 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            582 non-null    object
 1   place_with_parent_names  582 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  582 non-null    int64
 4   price_usd                582 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 27.3+ KB

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|M�xico|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59
1,house,|M�xico|Estado de M�xico|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73
2,house,|M�xico|Estado de M�xico|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69
4,apartment,|M�xico|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67
5,house,|M�xico|Jalisco|Guadalajara|,"20.689157,-103.366728",175,102763.00

### We saw in the data, we have 5 column which is not match with other dataset, because lat lon in single filed, but we need it different column becuase our other data is ame format, and also we need to work with place-with_parent_name

In [64]:
# drop 'NaN' value form df3
df3.dropna(inplace=True)

In [72]:
df3.info()
df3.head()

<class 'pandas.core.frame.DataFrame'>
Index: 582 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            582 non-null    object
 1   place_with_parent_names  582 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  582 non-null    int64
 4   price_usd                582 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 27.3+ KB

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|M�xico|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59
1,house,|M�xico|Estado de M�xico|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73
2,house,|M�xico|Estado de M�xico|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69
4,apartment,|M�xico|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67
5,house,|M�xico|Jalisco|Guadalajara|,"20.689157,-103.366728",175,102763.00

In [77]:
df3[["lat", "lon"]] = df3["lat-lon"].str.split(",", expand=True)
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,apartment,|M�xico|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59,19.52589,-99.151703
1,house,|M�xico|Estado de M�xico|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73,19.2640539,-99.5727534
2,house,|M�xico|Estado de M�xico|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69,19.268629,-99.671722
4,apartment,|M�xico|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67,19.511938,-96.871956
5,house,|M�xico|Jalisco|Guadalajara|,"20.689157,-103.366728",175,102763.00,20.689157,-103.366728

In [80]:
# drop the lat-lon column
df3.drop(columns=["lat-lon"])

,property_type,place_with_parent_names,area_m2,price_usd,lat,lon
0,apartment,|M�xico|Distrito Federal|Gustavo A. Madero|Acu...,71,48550.59,19.52589,-99.151703
1,house,|M�xico|Estado de M�xico|Toluca|Metepec|,233,168636.73,19.2640539,-99.5727534
2,house,|M�xico|Estado de M�xico|Toluca|Toluca de Lerd...,300,86932.69,19.268629,-99.671722
4,apartment,|M�xico|Veracruz de Ignacio de la Llave|Veracruz|,84,68508.67,19.511938,-96.871956
5,house,|M�xico|Jalisco|Guadalajara|,175,102763.00,20.689157,-103.366728
...,...,...,...,...,...,...
695,house,|M�xico|Jalisco|Tlajomulco de Z��iga|Tlajomulc...,175,121178.91,20.532264,-103.484418
696,house,|M�xico|Morelos|Jiutepec|,100,47417.83,18.9289862,-99.1802147
697,house,|M�xico|Yucat�n|M�rida|,81,39524.23,21.0284038368,-89.6530058049
698,house,|M�xico|San Luis Potos�|San Luis Potos�|,360,245050.24,22.11830417,-101.0321938992
699,house,|M�xico|Estado de M�xico|Toluca|Metepec|,115,110667.85,19.233201,-99.558519